package service

import "fmt"

func PrintBanner(endpoints string) {
	banner := `
 ________ ___  ___  ________   ________  ________                                                           
|\  _____\\  \|\  \|\   ___  \|\   ___ \|\_____  \                                                          
\ \  \__/\ \  \\\  \ \  \\ \  \ \  \_|\ \\|___/  /|                                                         
 \ \   __\\ \  \\\  \ \  \\ \  \ \  \ \\ \   /  / /                                                         
  \ \  \_| \ \  \\\  \ \  \\ \  \ \  \_\\ \ /  /_/__                                                        
   \ \__\   \ \_______\ \__\\ \__\ \_______\\________\                                                      
    \|__|    \|_______|\|__| \|__|\|_______|\|_______|                                                      

Serviço rodando na porta 8080

Endpoits:
` + endpoints

	fmt.Println(banner)
}
